{
  "Home": "الرئيسية",
  "About": "حول",
  "About Us": "معلومات عنا",
  "Team": "الفريق",
  "Services": "خدمات",
  "Our Projects": "مشاريعنا",
  "Contact Us": "اتصل بنا",
  "Showcase": "عرض",
  "Marketing": "تسويق",
  "Interactive": "تفاعلي",
  "Design": "تصميم",
  "Branding": "العلامة التجارية",
  "Translate to Arabic": "ترجم إلى العربية",
  "Optimal Cost in Quality Embedded Systems": "التكلفة المثلى في الأنظمة المدمجة عالية الجودة",
  "We support you in your embedded system development, absorbing the peaks in your workload seamlessly.": "نحن ندعمك في تطوير نظامك المضمن، ونستوعب فترات الذروة في عبء العمل لديك بسلاسة.",
  "MIRA Empowering <br/>Future with <br/>Digital Solutions!": "ميرا تمكّن <br/>المستقبل مع <br/>الحلول الرقمية!",
  "A Gateway to Digital Solutions": "بوابة إلى الحلول الرقمية",
  "14": "أربعة عشر",
  "Years of Digital Solutions Experience": "سنوات من الخبرة في الحلول الرقمية",
  "Our Mission": "مهمتنا",
  "MIRA has been a reliable and trusted partner for big and small businesses in the realm of embedded systems for years. With our innovative approach and skilled professionals, we deliver prompt solutions that best cater to your business needs. Our aim is to help our customers achieve their goals and enhance their competitiveness. We strive to make a positive contribution to society with our solutions. We are convinced that with our mission and vision, we can play a significant role in the future of the industry.": "كانت ميرا شريكًا موثوقًا به للشركات الكبيرة والصغيرة في مجال الأنظمة المدمجة لسنوات. من خلال نهجنا المبتكر والمهنيين المهرة، نقدم حلولًا سريعة تلبي احتياجات عملك بشكل أفضل. هدفنا هو مساعدة عملائنا على تحقيق أهدافهم وتعزيز قدرتهم التنافسية. نسعى للمساهمة الإيجابية في المجتمع من خلال حلولنا. نحن مقتنعون بأننا مع مهمتنا ورؤيتنا، يمكننا أن نلعب دورًا كبيرًا في مستقبل الصناعة.",
  "Our Basic Attitude": "موقفنا الأساسي",
  "<strong>Innovation:</strong/> We are constantly looking for new and innovative solutions to the challenges of tomorrow’s industry. <br /> <strong>Quality:</strong/> We set the highest quality standards in the development and implementation of our solutions. <br /> <strong>Reliability:</strong/> We are a reliable partner for our customers and always deliver the agreed services. <br /> <strong>Teamwork:</strong/> We work closely with our customers and partners to develop the best solutions together.": "<strong>الابتكار:</strong/> نحن نسعى باستمرار لإيجاد حلول جديدة ومبتكرة لتحديات صناعة الغد. <br /> <strong>الجودة:</strong/> نضع أعلى معايير الجودة في تطوير وتنفيذ حلولنا. <br /> <strong>الموثوقية:</strong/> نحن شريك موثوق لعملائنا ونسلم دائمًا الخدمات المتفق عليها. <br /> <strong>العمل الجماعي:</strong/> نعمل بشكل وثيق مع عملائنا وشركائنا لتطوير أفضل الحلول معًا.",
  "More About Us": "المزيد عنا",
  "Embedded Engineering": "الهندسة المدمجة",
  "We develop electronic systems for you that are embedded in other devices, such as cars, airplanes, household appliances and cell phones.": "نقوم بتطوير الأنظمة الإلكترونية التي يتم تضمينها في أجهزة أخرى، مثل السيارات والطائرات والأجهزة المنزلية والهواتف المحمولة.",
  "Highest Expectations": "أعلى التوقعات",
  "Our embedded engineering team meets the highest expectations by delivering reliable and high-performance systems tailored to your needs.": "يلبي فريق الهندسة المدمجة لدينا أعلى التوقعات من خلال تقديم أنظمة موثوقة وعالية الأداء مصممة خصيصًا لاحتياجاتك.",
  "High speed processing": "معالجة عالية السرعة",
  "Energy efficient solutions": "حلول كفاءة الطاقة",
  "Advanced security meaures": "تدابير أمان متقدمة",
  "Our embedded engineering team is dedicated to creating innovative and reliable solutions for a wide range of applications. With extensive expertise in designing, developing, and deploying embedded systems, we ensure high performance and seamless integration for industries such as automotive, medical, industrial automation, and consumer electronics.": "يكرس فريق الهندسة المدمجة لدينا جهوده لإنشاء حلول مبتكرة وموثوقة لمجموعة واسعة من التطبيقات. مع خبرة واسعة في تصميم وتطوير ونشر الأنظمة المدمجة، نضمن أداءً عاليًا وتكاملاً سلسًا للصناعات مثل السيارات والطب والأتمتة الصناعية والإلكترونيات الاستهلاكية.",
  "Battery Management": "إدارة البطاريات",
  "We develop software for you that monitors and controls batteries to increase their service life, performance and safety.": "نحن نطور برمجيات لك التي تراقب وتتحكم في البطاريات لزيادة عمر خدمتها وأدائها وسلامتها.",
  "Our battery management systems are engineered to enhance the performance, longevity, and safety of your batteries.": "نظم إدارة البطاريات الخاصة بنا مصممة لتعزيز أداء وطول عمر وسلامة بطارياتك.",
  "Robust protections against overcharging": "حماية قوية ضد الشحن الزائد",
  "Maximum energy usage": "استخدام طاقة ماكسيموم",
  "Meeting industry standards": "التوافق مع المعايير الصناعية",
  "Our battery management systems are designed to maximize the performance, longevity, and safety of your batteries. Leveraging advanced technologies and innovative engineering, we develop comprehensive solutions that monitor and control battery operations in real-time.": "تم تصميم نظم إدارة البطاريات الخاصة بنا لتعظيم أداء وطول عمر وسلامة بطارياتك. من خلال استغلال التقنيات المتقدمة والهندسة المبتكرة، نطور حلول شاملة تراقب وتتحكم في عمليات البطارية في الوقت الفعلي.",
  "Mobile App Development": "تطوير التطبيقات الجوالة",
  "We develop software applications for mobile devices such as smartphones and tablets.": "نقوم بتطوير تطبيقات البرمجيات لأجهزة الجوال مثل الهواتف الذكية والأجهزة اللوحية.",
  "Mobile app development revolutionizes how businesses connect with their customers, empowering seamless interactions and delivering unparalleled convenience.": "تطوير تطبيقات الجوال يحدث ثورة في كيفية تواصل الشركات مع عملائها، من خلال تمكين التفاعلات السلسة وتقديم الراحة التي لا مثيل لها.",
  "Compelling experiences": "تجارب مقنعة",
  "Robust measures to protect user data": "تدابير قوية لحماية بيانات المستخدم",
  "Fast, responsive apps": "تطبيقات سريعة ومستجيبة",
  "Mobile app development is the cornerstone of modern digital interaction, shaping how businesses engage with their audiences and deliver value. Our team specializes in crafting immersive, intuitive, and feature-rich mobile experiences across platforms.": "تطوير تطبيقات الجوال هو ركيزة التفاعل الرقمي الحديث، ويشكل كيفية تفاعل الشركات مع جمهورها وتقديم القيمة. يتخصص فريقنا في صياغة تجارب جوالة غامرة وسهلة الاستخدام وغنية بالميزات عبر المنصات.",
  "Hardware and Firmware development": "تطوير الأجهزة والبرمجيات الثابتة",
  "We develop and maintain hardware and software used in electronic devices.": "نقوم بتطوير وصيانة الأجهزة والبرمجيات المستخدمة في الأجهزة الإلكترونية.",
  "Hardware and firmware development form the foundation of technological innovation, powering the seamless integration of digital solutions. ": "تطوير الأجهزة والبرمجيات الثابتة يشكلان أساس الابتكار التكنولوجي، مما يدفع تكامل الحلول الرقمية بسلاسة.",
  "Seamless integration with existing systems": "تكامل سلس مع الأنظمة الحالية",
  "Robust security measures": "تدابير أمنية قوية",
  "Rigorous testing and validation": "اختبار وتحقق دقيق",
  "End-to-End Product Development": "تطوير المنتج من البداية إلى النهاية",
  "We develop products for you from conception to market launch.": "نقوم بتطوير المنتجات لكم من الفكرة إلى إطلاقها في السوق.",
  "End-to-end product development is the cornerstone of innovation, encompassing every stage from conception to delivery.": "تطوير المنتج من البداية إلى النهاية هو ركيزة الابتكار، حيث يشمل كل مرحلة من الفكرة إلى التسليم.",
  "Streamlined workflows and optimized resources": "تنظيم السير العمل وتحسين الموارد",
  "Environmentally friendly practices": "ممارسات صديقة للبيئة",
  "Prioritizing user needs and preferences": "التركيز على احتياجات وتفضيلات المستخدمين",
  "End-to-end product development encompasses the entire lifecycle of bringing a concept to market, from initial ideation to final deployment. At our core, we specialize in guiding businesses through this comprehensive journey, leveraging our expertise across design, engineering, and manufacturing domains.": "تطوير المنتج من البداية إلى النهاية يشمل جميع مراحل إحضار الفكرة إلى السوق، من الفكرة الأولية إلى النشر النهائي. في جوهر عملنا، نختص بتوجيه الشركات خلال هذه الرحلة الشاملة، مستفيدين من خبرتنا عبر مجالات التصميم والهندسة والتصنيع.",
  "Machine Learning": "تعلم الآلة",
  "We develop machine learning software that optimizes decision-making processes to enhance efficiency.": "نحن نطور برمجيات تعلم الآلة التي تحسن عمليات اتخاذ القرار لزيادة الكفاءة.",
  "Machine learning represents the pinnacle of data-driven intelligence, empowering systems to analyze vast amounts of data, uncover valuable insights, and make autonomous decisions. ": "يمثل تعلم الآلة قمة الذكاء المدفوع بالبيانات، حيث يمكنه تمكين الأنظمة من تحليل كميات ضخمة من البيانات، واكتشاف رؤى قيمة، واتخاذ قرارات ذاتية.",
  "High accuracy levels": "مستويات دقة عالية",
  "Transparency and interpretability of machine learning models": "شفافية وتفسير نماذج تعلم الآلة",
  "Upholding ethical standards": "الالتزام بالمعايير الأخلاقية",
  "Machine learning is revolutionizing the way we perceive and interact with data, empowering systems to learn from experience, adapt to new information, and make informed decisions autonomously. At the forefront of this transformation, our team specializes in harnessing the power of machine learning to unlock insights, drive innovation, and solve complex problems across industries.": "يقوم تعلم الآلة بثورة في كيفية فهمنا وتفاعلنا مع البيانات، حيث يمكنه تمكين الأنظمة من التعلم من التجارب، والتكيف مع المعلومات الجديدة، واتخاذ قرارات مستنيرة بشكل ذاتي. في طليعة هذه التحولات، يتخصص فريقنا في استغلال قوة تعلم الآلة لفتح الرؤى ودفع الابتكار وحل المشاكل المعقدة عبر مختلف الصناعات.",
  "Do you know that?": "هل تعرف أن؟",
  "Nobody takes ownership of the product?": "لا يتحمل أحد مسؤولية المنتج؟",
  "You're worried that your team isn't capable of building your product. They are not sure if they can achieve the vision for the product. We would be happy to support you with this.": "أنت قلق من أن فريقك غير قادر على بناء منتجك. ليسوا متأكدين مما إذا كانوا قادرين على تحقيق رؤية المنتج. سنكون سعداء بدعمك في هذا.",
  "Nobody feels responsible for the results?": "لا يشعر أحد بالمسؤولية عن النتائج؟",
  "This means you need a partner who understands your technology and is able to solve problems and develop new features without you having to constantly ask. We would be happy to support you with this": "هذا يعني أنك تحتاج إلى شريك يفهم تقنيتك ويكون قادرًا على حل المشاكل وتطوير ميزات جديدة دون أن تضطر إلى السؤال باستمرار. سنكون سعداء بدعمك في هذا",
  "Don't have time for strategy?": "ليس لديك وقت للإستراتيجية؟",
  "You want to shift your focus from operational product management to strategic decisions because you believe you can have a greater impact on the success of the product. We would be happy to support you with this.": "ترغب في تحويل تركيزك من إدارة المنتج التشغيلية إلى القرارات الاستراتيجية لأنك تعتقد أنك يمكن أن تكون لديك تأثير أكبر على نجاح المنتج. سنكون سعداء بدعمك في هذا.",
  "They require a lot of communication effort, which slows down the project": "يتطلبون جهدًا تواصليًا كبيرًا، مما يبطئ من سير المشروع",
  "In fact, if a project is poorly planned and managed, it can lead to communication problems and delays. We can prevent this for you.": "في الواقع، إذا كان المشروع مخططًا ومدارًا بشكل سيء، فقد يؤدي ذلك إلى مشاكل في التواصل وتأخيرات. يمكننا منع ذلك بالنسبة لك.",
  "Experts Team Members": "أعضاء فريق الخبراء",
  "We do awesome Services <br>for our clients.": "نقدم خدمات رائعة <br>لعملائنا.",
  "Raza Abbas": "رضا عباس",
  "CEO": "الرئيس التنفيذي",
  "R": "ر",
  "Age": "العمر",
  "34 years": "34 سنة",
  "Location": "الموقع",
  "Waitzstraße 92, 24118, Kiel": "شارع ويتزستراسه 92، 24118، كيل",
  "Email": "البريد الإلكتروني",
  "Phone No": "رقم الهاتف",
  "7 SOTD <br> 17 HONORABLE MENTION <br> 3 MOBILE EXCELLENCE": "7 جائزة موقع اليوم المختار <br> 17 إشادة موقرة <br> 3 تميز في المحمول",
  "31": "31",
  "11 SOTD <br> 5 SPECIAL KUDOS": "11 جائزة موقع اليوم المختار <br> 5 إشادة خاصة",
  "16": "16",
  "AWARD 2019 <br> 1 GLOBAL COMPETITION": "جائزة 2019 <br> 1 مسابقة عالمية",
  "20": "20",
  "He is the founder and CEO of Mira Dev, with over a decade of experience in both software and hardware development. His vision revolves around bridging the gap between humanity and the tech industry, a mission he diligently pursues each day.": "هو مؤسس والرئيس التنفيذي لشركة ميرا ديف، ولديه أكثر من عقد من الخبرة في تطوير البرمجيات والأجهزة. تدور رؤيته حول تقديم جسر بين البشرية وصناعة التكنولوجيا، مهمة يسعى جاهدًا لتحقيقها كل يوم.",
  "Abbas Madad Naqvi": "عباس مدد نقوي",
  "SAP B1 (HOD)": "SAP B1 (رئيس القسم)",
  "A": "أ",
  "35 years": "35 سنة",
  "Abbas leads the development of ERP systems, bringing his expertise in ERP software to the forefront. With vast experience in SAPB1, he has successfully completed numerous projects worldwide.": "يقود عباس تطوير أنظمة ERP، محملاً خبرته في برامج ERP إلى الصدارة. بفضل خبرته الواسعة في SAPB1، أكمل بنجاح العديد من المشاريع في جميع أنحاء العالم.",
  "Irtaza Madad": "إرتضى مدد",
  "Technical Project Manager": "مدير مشروع تقني",
  "I": "إ",
  "27 years": "27 سنة",
  "G-13, Islamabad, Pakistan": "جي-13، إسلام آباد، باكستان",
  "Irtaza is a Technical Project Manager specializing in software solutions and IoT development, adept at navigating the complexities of networks and emerging technologies. With 4 to 5 years of experience, he brings a wealth of expertise to the table.": "إرتضى مدد هو مدير مشروع تقني متخصص في حلول البرمجيات وتطوير الإنترنت من الأشياء، ماهر في التنقل في تعقيدات الشبكات والتقنيات الناشئة. بفضل خبرة تتراوح بين 4 إلى 5 سنوات، يجلب ثروة من الخبرة إلى الطاولة.",
  "Testimonials": "شهادات",
  "Rating from all Client's": "تقييمات من جميع العملاء",
  "Anneliese Ruff": "أنيليز روف",
  "Development": "تطوير",
  "Working with Mira Elektronikentwicklung has been an absolute pleasure.<br/>Their team of developers are truly impressive.<br/>Their talent and sharp skills consistently deliver outstanding results. Big thanks to Raza Abbas for his invaluable support whenever we need it. Highly recommended!": "العمل مع ميرا إليكترونيكنتويكلونج هو متعة مطلقة.<br/> فريق المطورين الخاص بهم مذهل حقاً.<br/> موهبتهم ومهاراتهم الحادة تسلم نتائج متميزة باستمرار. شكراً جزيلاً لرضا عباس على دعمه اللافت للنظر كلما احتجنا إليه. نوصي بهم بشدة!",
  "Frederick Leon": "فريدريك ليون",
  "Code Quality": "جودة الكود",
  "(We've been partnering with Mira Elektronikentwicklung for quite some time now, and their support has been instrumental in our testing and system management. Highly recommended for their expertise in software system development – they're truly specialists in their field).": "(لقد كنا نتعاون مع ميرا إليكترونيكنتويكلونج لفترة طويلة الآن، وكان دعمهم حاسمًا في اختبارنا وإدارة نظامنا. يوصى بشدة بخبرتهم في تطوير أنظمة البرمجيات - إنهم متخصصون حقًا في مجالهم).",
  "Send Us Your <br/><strong>Bright Ideas</strong>": "أرسل لنا <br/><strong>أفكارك المبدعة</strong>",
  "Get in Touch": "تواصل معنا",
  "<a href=\"mailto:info@mira-dev.de\" target=\"_blank\">info@mira-dev.de</a><p>Waitzstraße 92 24118 Kiel <br />+49 1522 6426128</p>": "<a href=\"mailto:info@mira-dev.de\" target=\"_blank\">info@mira-dev.de</a><p>شارع فيتز 92 24118 كيل <br />+49 1522 6426128</p>",
  "Facebook": "فيسبوك",
  "Instagram": "إنستجرام",
  "Twitter": "تويتر",
  "LinkedIn": "لينكد إن",
  "Fantastic and Premium Clients": "عملاء رائعون ومميزون",
  "We Have Had the Pleasure of <br/>Working with Some Clients": "لقد كان لنا متعة التعامل مع بعض العملاء",
  "Let’s Chat! Let’s Build Something <br /> Awesome Together": "دعونا نتحادث! دعونا نبني شيئًا رائعًا <br /> معًا",
  "Lets Start Project": "لنبدأ المشروع",
  "From the moment our company was founded, we have helped our clients find exceptional solutions": "منذ لحظة تأسيس شركتنا، قمنا بمساعدة عملائنا على إيجاد حلول استثنائية",
  "for their businesses": "لأعمالهم",
  "Projects": "المشاريع",
  "Waitzstraße 92 24118 Kiel": "Waitzstraße 92 24118 كييل",
  "Copyright © 2024 Mira All Rights Reserved.": "حقوق الطبع والنشر © 2024 ميرا جميع الحقوق محفوظة.",
  "Our Team": "فريقنا",
  "Meet our creativity company family.": "تعرف على عائلة شركة الإبداع لدينا.",
  "Our Services": "خدماتنا",
  "Our values and vaulted us to the top of our industry.": "قيمنا دفعتنا إلى قمة صناعتنا.",
  "What we do": "الذي نفعله",
  "We’re a full-service agency": "نحن وكالة متكاملة الخدمات",
  "MI Park": "مي بارك",
  "MIRA Empowering Future with Digital Solutions!": "MIRA تمكين المستقبل من خلال الحلول الرقمية!",
  "Welcome to Onovo": "مرحبًا بكم في أونوفو",
  "We are a digital agency,": "نحن وكالة رقمية،",
  "passionate about building": "متحمسون لبناء",
  "and designing brands": "وتصميم العلامات التجارية",
  "From the moment our company was founded, we have helped our clients find": "منذ تأسيس شركتنا، ساعدنا عملائنا في العثور على",
  "exceptional solutions for their businesses": "حلول استثنائية لأعمالهم",
  "creating memorable brands and digital products. Our expertise grows with each year, and our accumulated experience.": "وخلق علامات تجارية ومنتجات رقمية لا تُنسى. تتزايد خبرتنا مع كل عام، وتراكم خبرتنا.",
  "Team members": "أعضاء الفريق",
  "Completed projects": "المشاريع المكتملة",
  "M": "م",
  "Lines of code": "خطوط الشيفرة",
  "Our Goal": "هدفنا",
  "Our story unfolds at MIRA Dev, where a cohesive team of software experts is fueled by a collective passion for innovative software solutions. Specializing in web apps, mobile apps, but also in enterprise resource planning (ERP), SAP Business One (SAPB1), and Point of Sale (POS) systems, we stand as pioneers in reshaping the digital landscape of business operations Though it's been just a year since we embarked on the MIRA Dev journey, we've already achieved remarkable milestones. However, our vision extends far beyond these accomplishments. We are poised to break new ground, pushing the boundaries of innovation and setting new standards in the software industry. Our commitment to excellence drives us forward as we continue to evolve, adapt, and conquer new horizons. With every challenge we overcome and every goal we surpass, we reaffirm our dedication to shaping a brighter future for MIRA Dev and the world of software solutions. Our journey at MIRA Dev is marked by a steadfast commitment to growth and excellence. What began as a close-knit group of professionals has blossomed into a thriving community, dedicated to pushing the boundaries of software innovation.": "تتكشف قصتنا في MIRA Dev، حيث يعمل فريق متماسك من خبراء البرمجيات بشغف جماعي للحلول البرمجية المبتكرة. متخصصون في تطبيقات الويب، وتطبيقات الهاتف المحمول، وأيضًا في تخطيط موارد المؤسسات (ERP)، وSAP Business One (SAPB1)، وأنظمة نقاط البيع (POS)، ونحن نقف كرواد في إعادة تشكيل المشهد الرقمي للعمليات التجارية على الرغم من أنه كان مجرد بعد عام من انطلاقنا في رحلة MIRA Dev، حققنا بالفعل إنجازات رائعة. ومع ذلك، فإن رؤيتنا تمتد إلى ما هو أبعد من هذه الإنجازات. نحن على استعداد لفتح آفاق جديدة، ودفع حدود الابتكار ووضع معايير جديدة في صناعة البرمجيات. إن التزامنا بالتميز يدفعنا إلى الأمام بينما نواصل التطور والتكيف وغزو آفاق جديدة. مع كل تحد نتغلب عليه وكل هدف نتجاوزه، نؤكد من جديد التزامنا بتشكيل مستقبل أكثر إشراقًا لشركة MIRA Dev وعالم الحلول البرمجية. تتميز رحلتنا في MIRA Dev بالالتزام الثابت بالنمو والتميز. ما بدأ كمجموعة متماسكة من المحترفين قد ازدهر ليصبح مجتمعًا مزدهرًا، مكرسًا لدفع حدود ابتكار البرمجيات.",
  "Driven by a deep-seated trust and shared vision, we forge ahead with each project, crafting bespoke solutions that empower businesses and individuals alike. With a focus on real-time functionality and cutting-edge technology, we elevate processes and drive tangible results. At MIRA Dev, we understand the power of SEO in enhancing online visibility and driving organic traffic. By optimizing every aspect of our solutions, we ensure that our clients stand out in the digital landscape, commanding attention and achieving their goals. Join us on our journey as we continue to script a compelling narrative for MIRA Dev, shaping the future of software solutions with innovation, expertise, and a touch of passion and dedication.": "انطلاقًا من الثقة العميقة والرؤية المشتركة، فإننا نمضي قدمًا في كل مشروع، ونصمم حلولًا مخصصة لتمكين الشركات والأفراد على حدٍ سواء. ومن خلال التركيز على الأداء الوظيفي في الوقت الفعلي والتكنولوجيا المتطورة، فإننا نعمل على رفع مستوى العمليات وتحقيق نتائج ملموسة. في MIRA Dev، نحن نفهم قوة تحسين محركات البحث (SEO) في تعزيز الظهور عبر الإنترنت وزيادة حركة المرور العضوية. من خلال تحسين كل جانب من جوانب حلولنا، نضمن أن يبرز عملاؤنا في المشهد الرقمي، ويجذبون الاهتمام ويحققون أهدافهم. انضم إلينا في رحلتنا بينما نواصل كتابة سرد مقنع لـ MIRA Dev، لتشكيل مستقبل الحلول البرمجية من خلال الابتكار والخبرة ولمسة من العاطفة والتفاني."
}
